---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.FarthestDevice
enum: Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode
source: html/ee98a836-6a40-db03-ef1e-655424d04a9a.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.FarthestDevice

The circuit path connects to the farthest devices.